CLASS_QUANTITY = 11

WEEKDAYS = {
    0: 'Понеділок',
    1: 'Вівторок',
    2: 'Середа',
    3: 'Четвер',
    4: "П'ятниця",
    5: 'Субота',
}

WEEKDAYS_DB = {
    0: 'Monday',
    1: 'Tuesday',
    2: 'Wednesday',
    3: 'Thursday',
    4: "Friday",
    5: 'Saturday',
}

REGISTRATION_OPTIONS = {
    0: 'Вчитель',
    1: 'Учень',
}

REGISTRATION_LABELS_TEACHER = {
    0: 'ІПН',
    1: "І'мя",
    2: 'Прізвище',
    3: 'По-батькові',
    4: 'День народження',
    5: "Клас*",
    6: 'Пошта',
    7: 'Логін',
    8: 'Номер телефону',
    9: 'Стать',
    10: 'Пароль',
    11: 'Повторіть пароль',
}

REGISTRATION_LABELS_STUDENT = {
    0: 'ІПН*',
    1: "І'мя",
    2: 'Прізвище',
    3: 'По-батькові',
    4: 'День народження',
    5: "Клас*",
    6: 'Пошта',
    7: 'Логін',
    8: 'Номер телефону',
    9: 'Стать',
    10: 'Пароль',
    11: 'Повторіть пароль',
}

REGISTRATION_LABELS = [
    REGISTRATION_LABELS_TEACHER,
    REGISTRATION_LABELS_STUDENT,
]

SEARCH_LABELS = {
    0: "Ім'я",
    1: 'Прізвище',
}

SHOW_MESSAGE_CODES = {
    0: "Одне або декілька полів пусті.",
    1: "Некоректні дані.",
    2: "Користувачів не знайдено.",
    3: "Паролі не співпадають",
    4: "Вчителя успішно додано.",
    5: "Учня/ученицю успішно додано."
}
